/*
 문제 1

	풀이 
	10진수는 0~9로 표현
	2진수는 0~1로 표현
	16진수는 0~9,A~F로 표현

10진수	2진수	16진수
	8	 1000    0x8
	9	 1001	 0x9
   10	 1010	 0xA
   11    1011    0xB
   12	 1100	 0xC
   13	 1101	 0xD
   14	 1110	 0xE
   15	 1111	 0xF
   16	10000	 0x10
   17	10001	 0x11
   18	10010	 0x12
   19	10011	 0x13
   20	10100	 0x14




 문제 2

 풀이:
 10진수는 0부터 9까지의 숫자를 이용해 수를 표현한다.
 7진수는  0부터 6까지의 숫자를 이용해 수를 표현한다.


 8진수는 0부터 7까지의 숫자를 이용해 수를 표현한다.

 10진수	7진수	8진수
 5		 5		 5
 6		 6		 6
 7		 10		 7
 8		 11		 10
 9		 12		 11
 10		 13		 12
 11		 14		 13
 12		 15		 14
 13		 16		 15
 14		 20		 16
 15		 21		 17
 16		 22		 20
 17		 23		 21
 18		 24		 22
*/